softrider70/autofrontcam/cyd/sdkconfig.defaults
# CYD ESP32-2432S028R (klassisch: ESP32-WROOM-32, 4MB Flash, KEIN PSRAM)
CONFIG_IDF_TARGET="esp32"

# Dual-Core
CONFIG_FREERTOS_UNICORE=n

# Kein PSRAM auf dem klassischen CYD - Memory-bewusst programmieren!
# (JPEG wird mit Skalierung 1:4 dekodiert -> nur 38 KB Puffer noetig)
CONFIG_SPIRAM=n

# CPU Takt
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

# Flash: 4MB
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y

# Eigene Partitionstabelle (einfach, ohne OTA - CYD braucht kein OTA)
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Console: UART (Standard-USB-TTL)
CONFIG_ESP_CONSOLE_UART_DEFAULT=y

# Watchdogs: INT-WDT an (ESP32-D0WD-V3 Cache-Lock-Bug), Task-WDT aus
CONFIG_ESP_TASK_WDT_INIT=n
CONFIG_ESP_TASK_WDT=n
CONFIG_ESP_INT_WDT=y

# FreeRTOS
CONFIG_FREERTOS_HZ=100
CONFIG_FREERTOS_IDLE_TASK_STACKSIZE=1536
CONFIG_ESP_IPC_TASK_STACK_SIZE=2048

# HTTP Server/Client
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024
CONFIG_HTTPD_MAX_URI_LEN=512

# Logging
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL=4

# mDNS / DNS (fuer spaetere Namensaufloesung)
CONFIG_LWIP_DNS_SUPPORT_MDNS_QUERIES=y

# Compiler-Optimierung: -Os (Groessenoptimierung) - verhindert IRAM-Ueberlauf
CONFIG_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_MBEDTLS_COMPILER_OPTIMIZATION_SIZE=y
